# MasonryCMUColorByObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MasonryCMU..::..MasonryCMUColorByObject Property
MasonryCMU Class See Also
---
The property labeled "Color By Object" from the "MasonryCMU" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string MasonryCMUColorByObject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MasonryCMUColorByObject As String
	Get
```

Visual C++
---
```text
public:
static property String^ MasonryCMUColorByObject {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
MasonryCMU Class
Autodesk.Revit.DB.Visual Namespace